CSI API ETABS v1
cCaseStaticNonlinear.GetInitialCase Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetInitialCase(
	string Name,
	ref string InitialCase
)
Function GetInitialCase (
	Name As String,
	ByRef InitialCase As String
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim InitialCase As String
Dim returnValue As Integer
returnValue = instance.GetInitialCase(Name,
	InitialCase)
int GetInitialCase(
	String^ Name,
	String^% InitialCase
)
abstract GetInitialCase :
        Name : string *
        InitialCase : string byref -> int
Parameters
Name
Type: System.String
InitialCase
Type: System.String
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace